{
  "storymap": {
    "language": "en",
    "map_type": "watercolor",
    "calculate_zoom": true,
    "slides": [
      {
        "type": "overview",
        "text": {
          "headline": "Ballroom Culture Migration: 1970s–1990s",
          "text": "This map visualizes the migration of New York City’s ballroom culture from Harlem to downtown Manhattan and Brooklyn. It highlights the geographic shift in cultural hubs, from historically Black neighborhoods like Harlem and Crown Heights to areas like SoHo, Chelsea, and the West Village. The map also tracks the dual pressures of displacement and the AIDS crisis on Black and Latinx LGBTQ+ communities. New York’s queer nightlife reflected these transformations in venues ranging from community halls to boutique stores and dance clubs."
        }
      },
      {
        "location": {
          "lat": 40.8021,
          "lon": -73.9496,
          "name": "Up the Down Staircase Site, Harlem"
        },
        "text": {
          "headline": "115th & 5th (1967): Early Public Space",
          "text": "This Harlem corner—filming site of *Up the Down Staircase*—marked an early moment of Black youth visibility and protest performance in public space. Harlem’s density, legacy of the Great Migration, and cultural richness created a fertile backdrop for future ballroom scenes."
        }
      },
      {
        "location": {
          "lat": 40.8107,
          "lon": -73.948,
          "name": "Elks Lodge, Harlem"
        },
        "text": {
          "headline": "Elks Lodge (1984)",
          "text": "Hosted the iconic 'Paris Is Burning Ball' in 1984. A cultural anchor in Harlem, where AIDS rates were devastating Black communities and many queer events doubled as spaces for grief, joy, and community health."
        }
      },
      {
        "location": {
          "lat": 40.8141,
          "lon": -73.9535,
          "name": "Andre’s Bar, Harlem"
        },
        "text": {
          "headline": "Andre’s Bar on 125th Street",
          "text": "A center of 1980s Black queer nightlife in Harlem. Located near the Apollo, this space bridged street culture, survival networks, and dance traditions that shaped voguing and ball performance."
        }
      },
      {
        "location": {
          "lat": 40.763627,
          "lon": -73.984122,
          "name": "Roseland Ballroom"
        },
        "text": {
          "headline": "Roseland Ballroom (1989–1991)",
          "text": "The 'Love Balls' AIDS fundraisers here raised over $1.5 million. For many Black and Latinx performers, it was a bittersweet milestone—mainstream visibility amid ongoing loss and state neglect."
        }
      },
      {
        "location": {
          "lat": 40.7437,
          "lon": -74.0073,
          "name": "Tracks, Chelsea"
        },
        "text": {
          "headline": "Club Tracks, Chelsea",
          "text": "By the 1990s, ballroom migrated downtown. Tracks was a premier site for events like 'Legends, Statements & Stars'—a shift into gentrified queer nightlife that often erased its Harlem roots."
        }
      },
      {
        "location": {
          "lat": 40.723,
          "lon": -73.994,
          "name": "Better Days Club"
        },
        "text": {
          "headline": "Better Days, Hudson Square",
          "text": "A crucial Black gay venue in the 1980s, where many ballroom figures performed. It hosted voguing nights and served as a cultural and sonic laboratory for queer Black artists and dancers."
        }
      },
      {
        "location": {
          "lat": 40.7244,
          "lon": -74.0007,
          "name": "Susanne Bartsch Boutique, SoHo"
        },
        "text": {
          "headline": "Susanne Bartsch’s Boutique, SoHo",
          "text": "Located on West Broadway, her fashion boutique helped stage downtown performance scenes. Her ball events introduced ballroom icons to new audiences—part of a complex cultural crossover."
        }
      },
      {
        "location": {
          "lat": 40.7577,
          "lon": -73.9838,
          "name": "Copacabana, Midtown"
        },
        "text": {
          "headline": "Copacabana, Midtown",
          "text": "A cornerstone of Latinx nightlife in New York. Though not a ballroom venue, it shaped aesthetic codes and rhythms absorbed by adjacent queer Latinx communities and performers."
        }
      }
    ]
  }
}